{
  "backend/main.mo": "Defines two public functions: one to proxy OutCall.transform and another to fetch link previews via a MetaLink API with URL validation.",
  "feature_evidence.json": "Lists feature evidence for two frontend changes related to replacing media in the AVAIL card and adding user-provided images as static assets.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files and sections across the project for reference.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH design tokens for light/dark themes plus global background and border styling.",
  "frontend/index.html": "HTML entry point setting the document title and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main application layout rendering all major sections with a ThemeProvider and smooth scrolling.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, quick links, social links, and Caffeine.ai attribution.",
  "frontend/src/components/ImageOpenInNewTab.tsx": "Reusable component that wraps an image in a new‑tab link with hover-scale effects.",
  "frontend/src/components/LinkPreview.tsx": "Displays a link preview card using useLinkPreview with loading, error, and success states.",
  "frontend/src/components/MarqueeLinkPreviewBand.tsx": "Renders a horizontally scrolling marquee of duplicated LinkPreview components.",
  "frontend/src/components/Navbar.tsx": "Responsive navbar with scroll detection, smooth-scroll behavior, and a mobile sheet menu.",
  "frontend/src/components/PortfolioDetails.tsx": "Empty file; no implementation present.",
  "frontend/src/components/sections/AboutSection.tsx": "Displays an About section with background, bio paragraphs, and buttons to download a CV or view a portfolio.",
  "frontend/src/components/sections/AskMyNarrativeBrainSection.tsx": "Shows example prompts and a CTA button that scrolls to the contact section. Wrapped in a styled card with header and description.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with validation, mailto submission, clipboard copy, and social links. Manages form state, errors, and toast notifications.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Renders an experience timeline using content data, showing roles, periods, descriptions, and highlights. Supports images and badges for each entry.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero header with background image, name, headlines, description, and CTA buttons that scroll to other sections.",
  "frontend/src/components/sections/MarketNotesSection.tsx": "Lists writing topics and shows a marquee of links, plus buttons to browse notes or subscribe. Wrapped in a styled content card.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Empty placeholder file for a future portfolio section.",
  "frontend/src/components/sections/SectionHeader.tsx": "Reusable section header component supporting title, optional subtitle, and alignment.",
  "frontend/src/components/sections/SelectedSignalsSection.tsx": "Renders a grid of curated 'signals' cards with titles, descriptions, optional images, link previews, and external links. Uses UI components to display featured strategic work items.",
  "frontend/src/components/sections/SelectsSection.tsx": "Displays a grid of select portfolio items with images, metadata, tags, and links. Pulls data from selectsContent and formats each item into a styled card.",
  "frontend/src/components/sections/ServicesSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/StrategicTransformationsSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/WhatIBuildSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/XPostEmbed.tsx": "Embeds an X/Twitter post by loading the widgets script and rendering a tweet blockquote. Uses a ref to load the widget when the URL changes.",
  "frontend/src/content/aboutContent.ts": "Exports brief biographical text describing marketing and growth experience in fintech and Web3.",
  "frontend/src/content/aurientExperienceContent.ts": "Defines an experience item interface and exports a list of professional experience entries with roles, periods, descriptions, and highlights.",
  "frontend/src/content/aurientSelectsContent.ts": "Defines a SelectItem interface and exports curated project entries with categories, descriptions, tags, years, and images.",
  "frontend/src/content/marketNotesWritingLinks.ts": "Exports an array of external writing and publication links.",
  "frontend/src/content/portfolioData.ts": "Deprecated placeholder exporting an empty array.",
  "frontend/src/content/servicesData.ts": "Deprecated placeholder exporting an empty array.",
  "frontend/src/content/siteContent.ts": "Defines site-wide content including hero text, section titles, and subtitles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Dfinity AuthClient, exposing identity, login, clear, and status flags.",
  "frontend/src/hooks/useLinkPreview.ts": "Fetches and caches link preview metadata via backend actor, parsing responses and handling invalid URLs.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating React Query hooks exist; currently exports nothing.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, global styles, utilities, and custom animations/effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/categoryLabels.ts": "Maps verbose category names to concise uppercase labels and exposes helper functions to retrieve them.",
  "frontend/src/utils/contactMessage.ts": "Formats contact form input into a structured text message.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, plugins, and content paths.",
  "project_state.json": "Holds project metadata, known issues, image requirements, and pending feature requests for build planning."
}