{
  "backend/main.mo": "Defines transform passthrough and an HTTPS‑validated link‑preview fetch using OutCall.httpGetRequest.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for build analysis.",
  "frontend/index.css": "Sets Tailwind base layers and OKLCH design tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Composes the full site layout with themed sections and smooth scrolling.",
  "frontend/src/components/Footer.tsx": "Renders footer with branding, quick links, social links, and attribution.",
  "frontend/src/components/ImageOpenInNewTab.tsx": "Reusable image component that opens the source in a new tab.",
  "frontend/src/components/LinkPreview.tsx": "Fetches and displays link preview cards with loading, fallback, and success states.",
  "frontend/src/components/MarqueeLinkPreviewBand.tsx": "Creates a looping marquee of link previews with duplicated URLs for seamless scrolling.",
  "frontend/src/components/Navbar.tsx": "Responsive navbar with smooth-scroll navigation, a logo, desktop links, and a mobile sheet menu.",
  "frontend/src/components/PortfolioDetails.tsx": "Empty placeholder component with no content.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with biography text and buttons to download a CV or view a portfolio.",
  "frontend/src/components/sections/AskMyNarrativeBrainSection.tsx": "Section showcasing example prompts and a button that scrolls users to the contact form.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form with validation, email composition, clipboard copying, and direct contact info.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Maps and displays experience items with images, roles, periods, descriptions, and achievement lists.",
  "frontend/src/components/sections/HeroSection.tsx": "Full-screen hero with background image, headline, subheadline, body text, and CTA buttons for navigation.",
  "frontend/src/components/sections/MarketNotesSection.tsx": "Market Notes section with writing topics, a marquee of links, and buttons to browse or subscribe.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Empty placeholder section with no content.",
  "frontend/src/components/sections/SectionHeader.tsx": "Reusable section header component supporting title, subtitle, and alignment options.",
  "frontend/src/components/sections/SelectedSignalsSection.tsx": "Renders a grid of featured 'signal' cards with titles, descriptions, and optional link previews. Maps over static signal data to display cards with external links.",
  "frontend/src/components/sections/SelectsSection.tsx": "Displays a grid of featured work items using selectsContent, showing images, metadata, tags, and external project links. Uses cards and badges for structured presentation.",
  "frontend/src/components/sections/ServicesSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/StrategicTransformationsSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/WhatIBuildSection.tsx": "Empty file with no implementation.",
  "frontend/src/content/aboutContent.ts": "Exports static about-page text containing three descriptive paragraphs about background and work focus.",
  "frontend/src/content/aurientExperienceContent.ts": "Defines an ExperienceItem interface and exports a list of experience entries with roles, periods, descriptions, highlights, and images.",
  "frontend/src/content/aurientSelectsContent.ts": "Defines a SelectItem interface and exports a list of curated project entries with descriptions, tags, images, and metadata.",
  "frontend/src/content/marketNotesWritingLinks.ts": "Exports an array of external URLs pointing to writing and articles.",
  "frontend/src/content/portfolioData.ts": "Deprecated file exporting an empty array placeholder for portfolio data.",
  "frontend/src/content/servicesData.ts": "Deprecated file exporting an empty array placeholder for services data.",
  "frontend/src/content/siteContent.ts": "Contains site-wide static content including hero text, section titles, and subtitles used across the UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authenticated Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing identity loading, login, logout, and related status through AuthClient.",
  "frontend/src/hooks/useLinkPreview.ts": "Fetches link preview data via backend actor using React Query, parsing responses and caching results.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating React Query hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode overrides, custom utilities, and visual effects like neon glows and marquee animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/utils/categoryLabels.ts": "Maps verbose category strings to concise labels (AI, ART, TECH, CRYPTO, CULTURE) and provides helper functions for retrieving them.",
  "frontend/src/utils/contactMessage.ts": "Formats contact form input into a plaintext message string.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and theme extensions using project-specific CSS variables.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests for UI updates matching aurient.ai’s styling."
}