{
  "backend/main.mo": "Actor exposing a transform proxy and a link‑preview fetcher using HTTPS validation and an external LinkPreview API.",
  "feature_evidence.json": "Feature‑evidence report listing revert‑related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend file purposes and recent UI/content updates.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme tokens for light/dark modes and global element styles.",
  "frontend/index.html": "HTML entry point setting the page title and loading the React app root.",
  "frontend/src/App.tsx": "Main app component rendering all site sections with a dark theme provider and smooth‑scroll behavior.",
  "frontend/src/components/Footer.tsx": "Footer with brand block, quick links, social icons, and attribution bar using smooth‑scroll navigation.",
  "frontend/src/components/ImageOpenInNewTab.tsx": "Utility component wrapping an image in a new‑tab link with hover scale animation.",
  "frontend/src/components/LinkPreview.tsx": "Link preview card handling loading, error fallback, and rich preview display via useLinkPreview.",
  "frontend/src/components/MarqueeLinkPreviewBand.tsx": "Horizontally scrolling marquee displaying repeated LinkPreview cards with gradient edge masks.",
  "frontend/src/components/Navbar.tsx": "Sticky header with scroll‑aware styling, desktop links, and a mobile slide‑out menu.",
  "frontend/src/components/PortfolioDetails.tsx": "Empty file placeholder for portfolio detail logic.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with career background text and buttons for downloading a CV or viewing a portfolio.",
  "frontend/src/components/sections/AskMyNarrativeBrainSection.tsx": "Displays example narrative prompts and a button that scrolls to the contact section to open an assistant.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, email composition, clipboard copying, and direct contact info.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Shows a timeline of experience items with images, roles, descriptions, and achievement lists.",
  "frontend/src/components/sections/HeroSection.tsx": "Full-screen hero with background image, headline, subheadline, description, and CTAs that scroll to other sections.",
  "frontend/src/components/sections/MarketNotesSection.tsx": "Presents writing topics, a scrolling marquee of links, and buttons to browse notes or subscribe.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Empty placeholder file for a future Portfolio section.",
  "frontend/src/components/sections/SectionHeader.tsx": "Reusable section header component supporting a title, optional subtitle, and alignment settings.",
  "frontend/src/components/sections/SelectedSignalsSection.tsx": "Renders a grid of curated project signals with titles, descriptions, embeds, and link previews. Uses Card components and conditionally shows X posts or previews based on config.",
  "frontend/src/components/sections/SelectsSection.tsx": "Displays a grid of featured work items using selectsContent, showing images, tags, metadata, and external links inside Card components. Includes a section header and styled layout.",
  "frontend/src/components/sections/ServicesSection.tsx": "Empty placeholder file for a future Services section.",
  "frontend/src/components/sections/StrategicTransformationsSection.tsx": "Empty placeholder file for a future Strategic Transformations section.",
  "frontend/src/components/sections/WhatIBuildSection.tsx": "Empty placeholder file for a future What I Build section.",
  "frontend/src/components/XPostEmbed.tsx": "Embeds an X/Twitter post by loading the widgets script and rendering a blockquote linked to the tweet URL.",
  "frontend/src/content/aboutContent.ts": "Exports about text content consisting of three short descriptive paragraphs about professional background and focus.",
  "frontend/src/content/aurientExperienceContent.ts": "Defines an experience item interface and exports a list of structured experience entries with roles, descriptions, highlights, and images.",
  "frontend/src/content/aurientSelectsContent.ts": "Exports structured data for select featured projects including titles, categories, descriptions, tags, years, and images.",
  "frontend/src/content/marketNotesWritingLinks.ts": "Exports an array of external writing URLs for market notes and articles.",
  "frontend/src/content/portfolioData.ts": "Deprecated file exporting an empty portfolio data array.",
  "frontend/src/content/servicesData.ts": "Deprecated file exporting an empty services data array.",
  "frontend/src/content/siteContent.ts": "Holds static site text including hero content, section titles, and subtitles used across the frontend.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, identity loading, and status management for the app.",
  "frontend/src/hooks/useLinkPreview.ts": "React Query hook that fetches link preview metadata via the backend actor, parsing and returning structured preview data.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that backend-related React Query hooks belong here.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables, dark mode theming, utility classes, scrollbars, neon effects, and marquee animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, importing global styles and rendering App.",
  "frontend/src/utils/categoryLabels.ts": "Provides mappings from category names to concise labels (AI, ART, TECH, CRYPTO, CULTURE) and utility functions to retrieve them.",
  "frontend/src/utils/contactMessage.ts": "Formats contact form fields into a structured message string.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, OKLCH color tokens, animations, typography, and plugins.",
  "project_state.json": "Stores project metadata, state versioning, and feature history including revert requirements."
}