{
  "backend/main.mo": "Defines an actor with a transform passthrough and an HTTPS-only link preview fetcher using OutCall.httpGetRequest.",
  "feature_evidence.json": "Lists feature evidence entries describing required updates to SelectedSignalsSection.tsx, including link changes and a new card.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files, including updated link previews and new card details.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point setting page metadata and loading the React app.",
  "frontend/src/App.tsx": "Root React component assembling all site sections with dark theme and smooth scrolling.",
  "frontend/src/components/Footer.tsx": "Footer with quick links, social links, branding, smooth-scroll behavior, and caffeine.ai attribution.",
  "frontend/src/components/LinkPreview.tsx": "Renders URL previews with loading, fallback, and rich preview states using useLinkPreview.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth scrolling, scrolled-state styling, and mobile sheet menu.",
  "frontend/src/components/PortfolioDetails.tsx": "Empty file with no implemented content.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with bio text and buttons to download a CV or view a portfolio.",
  "frontend/src/components/sections/AskMyNarrativeBrainSection.tsx": "Displays example prompts and a button that scrolls to the contact section for inquiries.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, mailto submission, clipboard copying, and social/contact info.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, headline, subheadline, and CTA buttons that scroll to sections.",
  "frontend/src/components/sections/MarketNotesSection.tsx": "Shows topics of market notes and buttons to browse or subscribe.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Empty placeholder component.",
  "frontend/src/components/sections/SelectedSignalsSection.tsx": "Displays a grid of strategic work items with descriptions, link previews, and external links.",
  "frontend/src/components/sections/ServicesSection.tsx": "Empty placeholder component.",
  "frontend/src/components/sections/StrategicTransformationsSection.tsx": "Lists key strategic transformations with titles and descriptions in a grid.",
  "frontend/src/components/sections/WhatIBuildSection.tsx": "Presents capability categories describing narrative, GTM, and positioning work.",
  "frontend/src/content/aboutContent.ts": "Exports paragraph content used for the About section.",
  "frontend/src/content/portfolioData.ts": "Deprecated empty portfolio data array.",
  "frontend/src/content/servicesData.ts": "Deprecated empty services data array.",
  "frontend/src/content/siteContent.ts": "Defines static text content for site sections including hero, work, notes, about, and contact.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, storing identity and handling login state.",
  "frontend/src/hooks/useLinkPreview.ts": "Fetches link preview data from the backend actor and parses metadata with React Query caching.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for organizing React Query hooks; currently empty.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, dark mode, typography, scrollbar, and neon effects.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/contactMessage.ts": "Utility to format contact form data into a simple message string.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing site purpose, architecture notes, known issues, and implemented features."
}