{
  "kind": "build_request",
  "title": "Match Aurient.ai Selects/Experience styling, category labels, and image behaviors",
  "projectName": "Aurient Style Sections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Selects section UI to more closely match the styling and interaction patterns of the Selects section on https://www.aurient.ai/ (typography hierarchy, spacing, card layout, hover states), while keeping the app’s existing Tailwind theme tokens (e.g., accent/background/foreground).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes want the styling to match the styling of Selects and Expericne section as seen here - https://www.aurient.ai/"
        ]
      },
      "acceptanceCriteria": [
        "Selects section header, grid/card styling, and hover interactions visually align more closely with Aurient.ai’s Selects section (within the constraints of the existing design tokens).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Experience section UI to more closely match the styling and interaction patterns of the Experience section on https://www.aurient.ai/ (typography hierarchy, spacing, timeline/card layout, hover states), while keeping the app’s existing Tailwind theme tokens (e.g., accent/background/foreground).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes want the styling to match the styling of Selects and Expericne section as seen here - https://www.aurient.ai/"
        ]
      },
      "acceptanceCriteria": [
        "Experience section header and timeline/cards visually align more closely with Aurient.ai’s Experience section (within the constraints of the existing design tokens).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust Selects and Experience content labeling/writing so the visible category labeling style matches Aurient.ai’s concise, uppercase category labels: AI, ART, TECH, CRYPTO, CULTURE (use these exact labels where categories are displayed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It should use the same style of writing \nAI\nART\nTECH\nCRYPTO\nCULTURE"
        ]
      },
      "acceptanceCriteria": [
        "Where a category label is rendered in Selects and Experience, it uses one of these exact uppercase labels: AI, ART, TECH, CRYPTO, CULTURE.",
        "The UI does not display the previous longer category strings (e.g., “Protocol Positioning”) in the category label position."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the same images shown in Aurient.ai’s Selects and Experience sections to the corresponding items in this app, and ensure each image is clickable and opens the image in a new browser tab (target=\"_blank\" with rel=\"noopener noreferrer\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And it should have the same images displayed opening in new tab."
        ]
      },
      "acceptanceCriteria": [
        "Selects cards display images consistent with the images used on Aurient.ai’s Selects section, and Experience entries display images consistent with Aurient.ai’s Experience section (as applicable).",
        "Clicking an image opens the image in a new tab using target=\"_blank\" and rel=\"noopener noreferrer\".",
        "All images render reliably in production builds (no broken images)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths listed in SYSTEM_CONTEXT must not be edited; compose UI components instead of modifying their sources.",
    "All external links and image-open actions that open new tabs must include rel=\"noopener noreferrer\" for security."
  ],
  "nonGoals": [
    "No backend (Motoko) changes are required unless strictly necessary for the image display behavior.",
    "No new authentication, database, or third-party integrations beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}