{
  "kind": "build_request",
  "title": "Fix incorrect image swap: restore Hero background and update AVAIL — The Nexus Effect image",
  "projectName": "Shailey Portfolio",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the website Hero section background image to the original asset (undo the accidental replacement), so the Hero background is no longer the user-provided AVAIL image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Instead you have made the blunder of swapping it in the website hero background. Please correct your mistake immediately"
        ]
      },
      "acceptanceCriteria": [
        "HeroSection background image renders as it did before the mistaken swap (i.e., not the user-provided AVAIL image).",
        "The Hero section still uses the same src path currently referenced in code (frontend/src/components/sections/HeroSection.tsx), but the underlying asset content is restored to the original hero background."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the “AVAIL — The Nexus Effect” card within the Selected Signals section, replace the currently shown media (X embed/preview) with the user-provided image, and ensure only that AVAIL card is updated (no other sections).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You were supposed to swap the existing image in AVAIL — The Nexus Effect portion wiht the image provided by me."
        ]
      },
      "acceptanceCriteria": [
        "The “AVAIL — The Nexus Effect” card in frontend/src/components/sections/SelectedSignalsSection.tsx displays the user-provided image.",
        "The user-provided image does not appear as the Hero background.",
        "Other Selected Signals cards continue to behave as they did before (no unintended image changes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add the user-provided image as a static frontend asset (served from the frontend’s public assets) and reference it from the “AVAIL — The Nexus Effect” card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "swap the existing image in AVAIL — The Nexus Effect portion wiht the image provided by me"
        ]
      },
      "acceptanceCriteria": [
        "The user-provided image is stored under frontend/public/assets/ (or a subfolder) and is referenced via an absolute public path (e.g., /assets/...).",
        "No backend changes are required to serve or fetch the image."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn UI components are read-only and must be composed, not modified).",
    "Do not edit immutable hook/bootstrap files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not redesign the overall site layout or typography.",
    "Do not change Hero copy, CTAs, or scrolling behavior.",
    "Do not add new authentication, backend logic, or data storage."
  ],
  "imageRequirements": {
    "required": [
      "Dark-themed abstract tech/network illustration (avail-nexus-effect.dim_1600x900.png)"
    ],
    "edits": [
      "Restore the original hero background image content (1.png > 1.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}