{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Hero background asset and update AVAIL — The Nexus Effect card media",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the original Hero background image content while keeping the existing /assets/1.png src reference unchanged.",
      "acceptanceCriteria": [
        "HeroSection background image renders as it did before the mistaken swap (i.e., not the user-provided AVAIL image).",
        "The Hero section still uses the same src path currently referenced in code (frontend/src/components/sections/HeroSection.tsx), but the underlying asset content is restored to the original hero background."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/1.png",
          "operation": "modify",
          "description": "Replace the current (incorrect) Hero background image file content with the original Hero background image content, keeping the filename and public path unchanged so HeroSection continues to reference /assets/1.png."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update only the “AVAIL — The Nexus Effect” card to show the user-provided image instead of the current X embed/preview, leaving all other cards unchanged.",
      "acceptanceCriteria": [
        "The “AVAIL — The Nexus Effect” card in frontend/src/components/sections/SelectedSignalsSection.tsx displays the user-provided image.",
        "The user-provided image does not appear as the Hero background.",
        "Other Selected Signals cards continue to behave as they did before (no unintended image changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/SelectedSignalsSection.tsx",
          "operation": "modify",
          "description": "Update the signals data/rendering so only the “AVAIL — The Nexus Effect” card shows a static image (from /assets/...) in place of the XPostEmbed/preview; keep other cards’ embed/preview behavior unchanged. Optionally compose the existing ImageOpenInNewTab component for the image presentation (do not modify any files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add the user-provided AVAIL image as a static public asset and reference it from the AVAIL card via an absolute /assets/... path.",
      "acceptanceCriteria": [
        "The user-provided image is stored under frontend/public/assets/ (or a subfolder) and is referenced via an absolute public path (e.g., /assets/...).",
        "No backend changes are required to serve or fetch the image."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/avail-nexus-effect.dim_1600x900.png",
          "operation": "create",
          "description": "Add the user-provided image as a static public asset at frontend/public/assets/generated/avail-nexus-effect.dim_1600x900.png so it can be referenced via an absolute /assets/... public path."
        },
        {
          "path": "frontend/src/components/sections/SelectedSignalsSection.tsx",
          "operation": "modify",
          "description": "Reference the new static asset (frontend/public/assets/generated/avail-nexus-effect.dim_1600x900.png) from the “AVAIL — The Nexus Effect” card using an absolute public path, ensuring no backend fetch/storage is introduced and no other section uses this image."
        }
      ]
    }
  ]
}